{
  "onchain": {
    "category": "Tech",
    "definition": "Activities, assets, or data that exist directly on a blockchain.",
    "explanation": "Being 'onchain' means actions are publicly verifiable, decentralized, and recorded permanently on a blockchain.",
    "examples": [
      "'This entire game runs onchain.'",
      "'Buying an NFT is an onchain transaction.'"
    ],
    "submitted_by": "@mx1000"
  },
  "Proof of Stake": {
    "category": "Consensus",
    "definition": "A blockchain consensus mechanism where validators are chosen based on the amount of crypto they stake.",
    "explanation": "Proof of Stake secures the network without needing energy-intensive mining. Validators earn rewards by staking coins and behaving honestly.",
    "examples": [
      "'Ethereum switched to Proof of Stake in 2022.'",
      "'You can earn rewards by staking in a Proof of Stake network.'"
    ],
    "submitted_by": "@mx1000"
  },
  "airdrop farming": {
    "category": "Strategy",
    "definition": "Actively using apps or wallets in hopes of qualifying for free token airdrops.",
    "explanation": "Airdrop farmers interact with projects, often across multiple wallets, aiming to maximize rewards when a new token is launched.",
    "examples": [
      "'People are farming airdrops on Base.'",
      "'Using new dApps is a common airdrop farming strategy.'"
    ],
    "submitted_by": "@mx1000"
  },
  "hard rug pull": {
    "category": "Scam",
    "definition": "When developers abandon a project and steal investors' funds suddenly.",
    "explanation": "In a hard rug pull, the creators take the money and vanish, leaving the project worthless and the investors stuck.",
    "examples": [
      "'That token was a hard rug pull.'",
      "'Always research teams to avoid getting hard rugged.'"
    ],
    "submitted_by": "@mx1000"
  },
  "bedrock fork": {
    "category": "Tech",
    "definition": "A blockchain fork based on Optimism’s Bedrock architecture.",
    "explanation": "Bedrock is Optimism’s modular Layer 2 stack. A 'Bedrock fork' means a chain built using its open-source, standardized components.",
    "examples": [
      "'Base is a Bedrock fork.'",
      "'Bedrock forks use shared security principles from Ethereum.'"
    ],
    "submitted_by": "@mx1000"
  },
  "cold storage": {
    "category": "Security",
    "definition": "Storing cryptocurrency offline, disconnected from the internet.",
    "explanation": "Cold storage methods like hardware wallets or paper wallets protect crypto from hacks by keeping private keys offline.",
    "examples": [
      "'I keep my ETH in cold storage for safety.'",
      "'Cold wallets are the gold standard for security.'"
    ],
    "submitted_by": "@mx1000"
  },
  "Frame (Farcaster)": {
    "category": "Social",
    "definition": "Interactive apps built directly into Farcaster posts.",
    "explanation": "Frames allow users to interact (mint NFTs, vote, buy, etc.) without leaving the Farcaster app, making posts action-based.",
    "examples": [
      "'Mint this NFT using the Frame below!'",
      "'Frames are Farcaster’s killer feature.'"
    ],
    "submitted_by": "@mx1000"
  },
  "GM GM": {
    "category": "Culture",
    "definition": "A double 'Good Morning' greeting popular in crypto communities.",
    "explanation": "'GM GM' shows excitement, positivity, and vibes with other crypto users — even if it's not actually morning.",
    "examples": [
      "'GM GM fren!'",
      "'GM GM, let's build!'"
    ],
    "submitted_by": "@mx1000"
  },
  "BM BM": {
    "category": "Culture",
    "definition": "A Farcaster-born spin on 'GM GM,' meaning 'Based Morning.'",
    "explanation": "'BM BM' is used mainly on Base and Farcaster to greet frens and celebrate being based early in the day.",
    "examples": [
      "'BM BM Base frens!'",
      "'Start your day with a BM BM.'"
    ],
    "submitted_by": "@mx1000"
  },
  "Anon": {
    "category": "Culture",
    "definition": "A nickname for anonymous users in crypto spaces.",
    "explanation": "Calling someone 'anon' acknowledges that they're using a pseudonym or hiding their real-world identity, common in Web3.",
    "examples": [
      "'Nice mint, anon!'",
      "'Anon knows what's up.'"
    ],
    "submitted_by": "@mx1000"
  },
  "Based": {
    "category": "Culture",
    "definition": "A compliment meaning cool, confident, or true to your beliefs — especially on Base blockchain.",
    "explanation": "'Based' started as a meme but now often means someone is doing something awesome or authentic, especially on Base L2.",
    "examples": [
      "'That post was so based.'",
      "'Based builders are changing the game.'"
    ],
    "submitted_by": "@mx1000"
  },
  "Base": {
    "category": "Layer 2",
    "definition": "A Layer 2 blockchain built on the OP Stack, incubated by Coinbase.",
    "explanation": "Base makes it easy for developers and users to access fast, cheap Ethereum transactions while staying decentralized.",
    "examples": [
      "'This NFT minted on Base for $0.01!'",
      "'Base season is every season.'"
    ],
    "submitted_by": "@mx1000"
  },
  "Jesse Pollak": {
    "category": "Personas",
    "definition": "Base Builder 01 and creator of Base, Coinbase’s Layer 2 network.",
    "explanation": "Jesse Pollak led the creation of Base, a Layer 2 blockchain built to make Ethereum accessible to millions of new users. He’s known for championing onchain culture, scaling crypto adoption, and making Base the most welcoming L2 ecosystem.",
    "examples": [
      "'Jesse Pollak wants to bring millions of people onchain.'",
      "'If Jesse’s building it, you know it’s based.'"
    ],
    "submitted_by": "@mx1000"
  },
  "Layer 2": {
    "category": "Tech",
    "definition": "A secondary blockchain built on top of another to improve speed and scalability.",
    "explanation": "Layer 2s like Base, Optimism, and Arbitrum handle transactions off the main Ethereum blockchain to reduce congestion and fees.",
    "examples": [
      "'Base is a Layer 2 on Ethereum.'",
      "'Layer 2s make Ethereum faster and cheaper.'"
    ],
    "submitted_by": "@mx1000"
  },
  "dyor": {
    "category": "Culture",
    "definition": "An acronym for 'Do Your Own Research,' encouraging individuals to investigate before making crypto decisions.",
    "explanation": "DYOR reminds people not to blindly trust advice online and to personally verify facts, risks, and opportunities in the crypto space. It’s a core principle for staying safe and informed.",
    "examples": [
      "'Before investing in that token, remember to DYOR.'",
      "'I saw it trending, but I’m gonna DYOR before aping in.'"
    ],
    "submitted_by": "@mx1000"
  },
"Bullish": {
  "category": "Market Sentiment",
  "definition": "Optimistic belief that an asset's price will rise.",
  "explanation": "If someone is bullish, they believe the market or a specific asset is going up in value. It’s often used to express strong confidence in positive future performance.",
  "examples": [
    "'I'm bullish on ETH this year.'",
    "'The market looks super bullish after that news.'"
  ],
  "submitted_by": "@mx1000"
},
"Bearish": {
  "category": "Market Sentiment",
  "definition": "Pessimistic belief that an asset's price will fall.",
  "explanation": "Being bearish means expecting the market or a particular asset to decline. Traders who are bearish may sell, short, or avoid buying.",
  "examples": [
    "'I’m bearish on meme coins right now.'",
    "'The charts are looking pretty bearish.'"
  ],
  "submitted_by": "@mx1000"
},
"Mfer": {
  "category": "Culture",
  "definition": "Slang term for 'motherf***er,' used affectionately in crypto circles to refer to fellow traders or degens.",
  "explanation": "Mfer is often used in a fun, friendly way between people who are deep into crypto, NFTs, or trading. It can also reference the iconic 'mfers' NFT collection.",
  "examples": [
    "'This mfer just minted the whole supply.'",
    "'Stay strong, mfer. The bull run is coming.'"
  ],
  "submitted_by": "@mx1000"
},

"Talent Protocol": {
  "category": "Onchain Social App",
  "definition": "A web3 platform where builders and creators launch talent tokens linked to their personal growth.",
  "explanation": "Talent Protocol allows users to invest in people early by supporting their journeys through talent tokens. It’s about building a reputation economy onchain.",
  "examples": [
    "'I just launched my profile on Talent Protocol!'",
    "'Talent Protocol is perfect for web3 builders growing their brand.'"
  ],
  "submitted_by": "@mx1000"
},

  "fomo": {
    "category": "crypto",
    "definition": "Fear of Missing Out",
    "explanation": "FOMO in crypto is \"Fear of Missing Out,\" FOMO in crypto is driving impulsive buying due to hype or rising pricesriving impulsive buying due to hype or rising prices",
    "examples": [
      "Dogecoin spikes 12,000% in 2021 from Musk's tweets. A trader buys at $0.70, fearing they'll miss out, but it crashes to $0.20. That's FOMO."
    ],
    "submitted_by": "@taproot"
  }
}
